// Задача 1_0. Напишите программу, которая на вход принимает число
// и выдает его квадрат

Console.WriteLine ( "Введите число");
int num = int.Parse (Console.ReadLine()!);
Console.WriteLine (num*num);


